'''
Автоперевікра 4 - 9: Всім відомо, що для доступу до кредитної картки банку потрібний пін-код. Класично склалося, що це поєднання чотири цифри. 
Нам необхідно вирішити наступне програмістське завдання. Є підготовлений перелік пін-кодів. Напишіть функцію is_valid_pin_codes, 
яка буде приймати як параметр список цих пін-кодів — рядок з чотирьох цифр і повертати логічне значення — валідний список чи ні.
 Переконайтеся, що серед цих пін-кодів у списку не буде дублікатів, всі вони зберігаються у вигляді рядків, 
 їх довжина дорівнює 4 символам і містять вони тільки цифри.

Приклад аргументу для функції is_valid_pin_codes:

['1101', '9034', '0011']
Якщо список відповідає всім поставленим умовам, функція повертає логічне значення True. 
Якщо хоч одну з умов порушено, повертається значення — False. Передбачити перевірку на порожній список в 
аргументі функції та повернути при цьому значення False.
'''


def have_duplicates(array):
    return not (len(set(array)) == len(array))


def is_valid_pin_codes(pincodes):
    if not pincodes:
        return False

    if have_duplicates(pincodes):
        return False
    
    for pincode in pincodes:
        is_not_digit = not pincode.isdigit()
        if not len(pincode) == 4 or is_not_digit or not isinstance(pincode, str):
            return False

    return True


a = ['1101', '9034', "0011", '121312']
print(is_valid_pin_codes(a))